EdgeGravity/STM32F429BIT6_TouchGFX/STM32F429BIT6_TouchGFX.ioc
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LCDTFTFreq_Value,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQCLKFreq_Value,PLLSAIN,PLLSourceVirtual,RTCFreq_Value,RTCHSEDivFreq_Value,SAI_AClocksFreq_Value,SAI_BClocksFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VCOSAIOutputFreq_ValueR,VcooutputI2S,VcooutputI2SQ
PJ0.Signal=LTDC_R1
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F429B(E-G-I)Tx
PE0.Signal=FMC_NBL0
PE12.Signal=FMC_D9_DA9
NVIC.SavedPendsvIrqHandlerGenerated=true
PA13.GPIO_Label=SWD
SH.FMC_D23.ConfNb=1
Mcu.IP8=TIM5
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=USART1
PD14.Signal=FMC_D0_DA0
Mcu.IP6=RCC
Mcu.IP7=SYS
ProjectManager.CoupleFile=true
RCC.48MHZClocksFreq_Value=90000000
RCC.SYSCLKFreq_VALUE=180000000
PI15.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
KeepUserPlacement=true
TIM5.Prescaler=19
PC15/OSC32_OUT.Mode=LSE-External-Oscillator
PJ5.Signal=LTDC_R6
SH.FMC_D23.0=FMC_D23,sd-32b-d1
PA14.Signal=SYS_JTCK-SWCLK
RCC.HSI_VALUE=16000000
PH2.Locked=true
PH3.Signal=FMC_SDNE0
PK3.Mode=RGB888
RCC.PLLM=4
PK3.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.PLLN=180
PI15.Signal=LTDC_R0
TIM5.Period=8399
PJ4.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D8_DA8.ConfNb=1
RCC.APB1Freq_Value=45000000
VP_CRC_VS_CRC.Mode=CRC_Activate
LTDC.ImageHeight_L0=480
PJ11.GPIOParameters=GPIO_Speed
ProjectManager.DeviceId=STM32F429BITx
DMA2D.Mode=DMA2D_M2M
ProjectManager.LibraryCopy=0
PJ13.Signal=LTDC_B1
PK1.GPIOParameters=GPIO_Speed
PJ12.Locked=true
